[{
        "name": "Cernunnos",
        "image_source": "https://www.celticjackalope.com/wp-content/uploads/2014/04/60004_436564839350_1662444_n.jpg",
        "wiki": "https://en.wikipedia.org/wiki/Cernunnos",
        "description": "Cernunnos is the conventional name given in Celtic studies to depictions of the 'horned god' of Celtic polytheism. Cernunnos was a Celtic god of fertility, life, animals, wealth, and the underworld. The name itself is only attested once, on the 1st-century Pillar of the Boatmen, but he appears all over Gaul, and among the Celtiberians."
    },
    {
        "name": "Nuada",
        "image_source": "https://i2.wp.com/www.jimfitzpatrick.com/wp-content/uploads/2012/10/NUADA-CONQUESTS-detail-3.jpg?fit=1000%2C940&ssl=1",
        "wiki": "https://en.wikipedia.org/wiki/Nuada",
        "description": "Nuada was king of the Tuatha Dé Danann for seven years before they came to Ireland. They made contact with the Fir Bolg, the then-inhabitants of the island, and Nuada sought from them half of the island for the Tuatha Dé, which their king rejected. Both peoples made ready for war, and in an act of chivalry allowed their numbers and arms to be inspected by the opposing side to allow for a truly fair battle. During this first great battle at Mag Tuired, Nuada lost an arm[1] in combat with the Fir Bolg champion Sreng. Nuada's ally, Aengaba of Norway, then fought Sreng, sustaining a mortal wound, while the Dagda protected Nuada. Fifty of the Dagda's soldiers carried Nuada from the field. The Tuatha Dé gained the upper hand in the battle, but Sreng later returned to challenge Nuada to single combat. Nuada accepted, on the condition that Sreng fought with one arm tied up. Sreng refused, but by this point the battle was won and the Fir Bolg all but vanquished. The Tuatha Dé then decided to offer Sreng one quarter of Ireland for his people instead of the one half offered before the battle, and he chose Connacht."
    },
    {
        "name": "Morrigan",
        "image_source": "https://pre00.deviantart.net/e9c0/th/pre/i/2013/189/1/d/_the_morrigan__and_her_crow_by_olderealms-d6ckedh.jpg",
        "wiki": "https://en.wikipedia.org/wiki/Morrigan",
        "description": "The Morrígan is mainly associated with war and fate, especially with foretelling doom, death or victory in battle. In this role she often appears as a crow, the badb.[1] She incites warriors to battle and can help bring about victory over their enemies. She also has some connection with sovereignty, the land and livestock. In modern times she is often called a 'war goddess' and has also been seen as a manifestation of the earth and sovereignty goddess."
    }
]
